{
  "projects": [
    {
      "id": "proj_1",
      "title": "Deep Learning for Medical Imaging",
      "description": "Developing CNN-based models for automated disease detection from chest X-rays",
      "objective": "Build a production-ready CNN model achieving >95% accuracy on chest X-ray pathology detection suitable for clinical deployment",
      "keyQuestions": [
        "Which architecture performs best on limited medical imaging data?",
        "How to handle class imbalance in rare disease detection?",
        "What data augmentation strategies preserve clinical validity?"
      ],
      "currentBlocker": "Need IRB approval for additional hospital dataset access (submitted 2 weeks ago)",
      "lastDecision": "Switched from ResNet-50 to EfficientNet-B4 based on ablation study results - 3% accuracy improvement with 40% fewer parameters",
      "nextAction": "Complete ablation study on data augmentation methods (targeted completion: Jan 30)",
      "stage": "in-progress",
      "progress": 35,
      "startDate": "2025-09-15",
      "tags": ["Deep Learning", "Medical AI", "Computer Vision", "Healthcare"],
      "createdAt": 1726358400000,
      "updatedAt": 1737331200000
    },
    {
      "id": "proj_2",
      "title": "Natural Language Processing for Legal Documents",
      "description": "Building transformer-based NLP pipeline for automated contract analysis and legal risk assessment",
      "objective": "Develop a fine-tuned transformer model that extracts key clauses and identifies legal risks in contracts with >90% precision",
      "keyQuestions": [
        "Can we effectively fine-tune BERT on legal domain with limited labeled data?",
        "How to handle multi-page context windows beyond 512 tokens?",
        "What evaluation metrics align with legal practitioner needs?"
      ],
      "currentBlocker": "Waiting for legal domain expert consultation on annotation guidelines (scheduled for Jan 25)",
      "lastDecision": "Will use LegalBERT as base model instead of generic BERT after literature review showed 15% F1 improvement",
      "nextAction": "Annotate 100 sample contracts for initial training set using agreed guidelines",
      "stage": "planning",
      "progress": 10,
      "startDate": "2026-01-05",
      "tags": ["NLP", "Legal Tech", "Transformers", "Contract Analysis"],
      "createdAt": 1735948800000,
      "updatedAt": 1737331200000
    }
  ]
}
